[M_Ep5_ThePhoenix MissionDefinition]
TurnInDescription="Lilith, alias ''the Firehawk'', has informed you that Roland was kidnapped by the same clan of bandits that invaded her lair. You'll have to rescue him."

[M_Ep5_ThePhoenix:GoToIceCanyonSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to defeat Jack, you will need to find a soldier named Roland. He's gone missing, but you have one lead: a fearsome bounty hunter, known as the Firehawk, summoned Roland shortly before your arrival. If you can find the Firehawk in [place]Frostburn Canyon[-place], maybe you'll find Roland, too."

[M_Ep5_ThePhoenix:GrabEridiumSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to defeat Jack, you will need to find a soldier named Roland. He's gone missing, but you have one lead: a fearsome bounty hunter, known as the Firehawk, summoned Roland shortly before your arrival. ''The Firehawk'', whom you found in [place]Frostburn Canyon[-place], was the alias of Lilith, a former Vault Hunter and associate of Roland's. She claims to be on your side -- if you and she can repel the remaining Bloodshots, she may have the information you need regarding Roland's whereabouts. Lilith will have an easier time kicking bandit butt if she's got some Eridium. She's asked you to fetch her some."

[M_Ep5_ThePhoenix:HelpLilithDefeatBanditsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to defeat Jack, you will need to find a soldier named Roland. He's gone missing, but you have one lead: a fearsome bounty hunter, known as the Firehawk, summoned Roland shortly before your arrival. ''The Firehawk'', whom you found in [place]Frostburn Canyon[-place], was the alias of Lilith, a former Vault Hunter and associate of Roland's. She claims to be on your side -- if you and she can repel the remaining Bloodshots, she may have the information you need regarding Roland's whereabouts."

[M_Ep5_ThePhoenix:LastWaveGiveEridiumSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to defeat Jack, you will need to find a soldier named Roland. He's gone missing, but you have one lead: a fearsome bounty hunter, known as the Firehawk, summoned Roland shortly before your arrival. ''The Firehawk'', whom you found in [place]Frostburn Canyon[-place], was the alias of Lilith, a former Vault Hunter and associate of Roland's. She helped you fight off a bunch of bandits, but now it's time to get down to business and find out where Roland is."

[M_Ep5_ThePhoenix:LastWaveGrabEridiumSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to defeat Jack and stop the warrior, you will need to find a soldier named Roland. He's gone missing, but you have one lead: a fearsome bounty hunter, known as the Firehawk, summoned Roland shortly before your arrival. ''The Firehawk'', whom you found in [place]Frostburn Canyon[-place], was the alias of Lilith, a former Vault Hunter and associate of Roland's. You fought off a group of bandits, but Lilith needs your help -- the fight took a lot out of her. She's asked you to bring her more Eridium."

[M_Ep5_ThePhoenix:ReviveLilithSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="In order to defeat Jack, you will need to find a soldier named Roland. He's gone missing, but you have one lead: a fearsome bounty hunter, known as the Firehawk, summoned Roland shortly before your arrival. ''The Firehawk,'' whom you found in [place]Frostburn Canyon[-place], was the alias of Lilith, a former Vault Hunter and associate of Roland's. She claims to be on your side -- if you and she can repel the remaining Bloodshots, she may have the information you need regarding Roland's whereabouts."
